In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from collections import Counter
%matplotlib inline
data = pd.read_csv(r'C:\\Users\Vincent\Desktop\Olympic\summer.csv\summer.csv')
data_dictionary=pd.read_csv(r'C:\Users\Vincent\Desktop\Olympic\dictionary.csv')

In [2]:
data.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [3]:
data_dictionary.head()

           Country Code  Population  GDP per Capita
0      Afghanistan  AFG  32526562.0      594.323081
1          Albania  ALB   2889167.0     3945.217582
2          Algeria  ALG  39666519.0     4206.031232
3  American Samoa*  ASA     55538.0             NaN
4          Andorra  AND     70473.0             NaN

In [4]:
data = data.rename(columns={'Country': 'Code',})
data_dictionary=data_dictionary.rename(columns={'Population':'Current Population','GDP per Capita':'Current GDP per Capita'})
data_dictionary.head()

           Country Code  Current Population  Current GDP per Capita
0      Afghanistan  AFG          32526562.0              594.323081
1          Albania  ALB           2889167.0             3945.217582
2          Algeria  ALG          39666519.0             4206.031232
3  American Samoa*  ASA             55538.0                     NaN
4          Andorra  AND             70473.0                     NaN

In [5]:
#Merge two dataframes
data_merge=pd.merge(data, data_dictionary, on=['Code'], how='inner')
data_merge.head()

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Country,Current Population,Current GDP per Capita
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Hungary,9844686.0,12363.54346
1,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,1200M Freestyle,Gold,Hungary,9844686.0,12363.54346
2,1896,Athens,Athletics,Athletics,"SZOKOLYI, Alajos",HUN,Men,100M,Bronze,Hungary,9844686.0,12363.54346
3,1896,Athens,Athletics,Athletics,"DANI, Nandor",HUN,Men,800M,Silver,Hungary,9844686.0,12363.54346
4,1896,Athens,Athletics,Athletics,"KELLNER, Gyula",HUN,Men,Marathon,Bronze,Hungary,9844686.0,12363.54346

In [6]:
#what are we interested in ?:
#countries with the most gold medals,with the most medals,in 1900
#countries with the largest growth in medals since 1900 --> (no. of medals last year/no. of medals in 1900)
#men,female medal winner ratio
#cities that held the most Olympic

In [7]:
#countries with the most gold medals
#goldmedals=data.loc[:,['Country','Medal']]
    
data1=data[data['Medal']=='Gold']

In [8]:
top10country=data1.groupby(['Medal','Code'])['Code'].count().sort_values(ascending=False).head(10)
top10country

Medal  Code
Gold   USA     2235
       URS      838
       GBR      546
       ITA      476
       GER      452
       HUN      412
       FRA      408
       SWE      349
       GDR      329
       AUS      312
Name: Code, dtype: int64

In [9]:
#total no.of medals obtained by the top 10 countries
Counter(data['Code']).most_common(10)

[('USA', 4585),
 ('URS', 2049),
 ('GBR', 1720),
 ('FRA', 1396),
 ('GER', 1305),
 ('ITA', 1296),
 ('AUS', 1189),
 ('HUN', 1079),
 ('SWE', 1044),
 ('NED', 851)]

In [10]:
#most_common=Counter(data['Country']).most_common(10)

In [11]:
#publisher_sales[publisher_sales['Publisher']=='Nintendo']

In [12]:
data_1900=data[data['Year']==1900]
data_1900.head(5)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal
151,1900,Paris,Aquatics,Swimming,"HALMAY, Zoltan",HUN,Men,1500M Freestyle,Bronze
152,1900,Paris,Aquatics,Swimming,"JARVIS, John Arthur",GBR,Men,1500M Freestyle,Gold
153,1900,Paris,Aquatics,Swimming,"WAHLE, Otto",AUT,Men,1500M Freestyle,Silver
154,1900,Paris,Aquatics,Swimming,"DROST, Johannes",NED,Men,200M Backstroke,Bronze
155,1900,Paris,Aquatics,Swimming,"HOPPENBERG, Ernst",GER,Men,200M Backstroke,Gold

In [13]:
Counter(data_1900['Code']).most_common(10)

[('FRA', 185),
 ('GBR', 78),
 ('USA', 55),
 ('GER', 40),
 ('BEL', 39),
 ('ZZX', 34),
 ('NED', 20),
 ('SUI', 15),
 ('NOR', 9),
 ('AUT', 6)]

In [14]:
#find the last Olympic Game year in dataset
data.Year.max()

2012

In [15]:
#find how many medals China got in 2012
data_China=data_merge[data_merge['Country']=='China']
data_China_2012=data_China[data_China['Year']==2012]

In [16]:
#this doesn't work  because you cannot use value_counts on strings!
#data_China_2012['Medal'].value_counts.plot(kind='bar')

In [17]:
data_China_2012.head()

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Country,Current Population,Current GDP per Capita
23968,2012,London,Aquatics,Diving,"QIU, Bo",CHN,Men,10M Platform,Silver,China,1.371220e+09,8027.68381
23969,2012,London,Aquatics,Diving,"CHEN, Ruolin",CHN,Women,10M Platform,Gold,China,1.371220e+09,8027.68381
23970,2012,London,Aquatics,Diving,"QIN, Kai",CHN,Men,3M Springboard,Silver,China,1.371220e+09,8027.68381
23971,2012,London,Aquatics,Diving,"HE, Chong",CHN,Men,3M Springboard,Bronze,China,1.371220e+09,8027.68381
23972,2012,London,Aquatics,Diving,"WU, Minxia",CHN,Women,3M Springboard,Gold,China,1.371220e+09,8027.68381

In [18]:
data_China_2012.groupby(['Medal'])['Country'].count().sort_values(ascending=False).head(10)

Medal
Gold      56
Silver    44
Bronze    28
Name: Country, dtype: int64

In [19]:
#Male,Female winner ratio
data_merge['Gender'].value_counts()

Men      19036
Women     6706
Name: Gender, dtype: int64

In [20]:
#Men gained more medals than women. 
#This can be that in the past women were less active in sports than men, so less sports events were designed for females.

In [21]:
data_merge.groupby(['City'])['Country'].count().sort_values(ascending=False)

City
London                   3440
Athens                   2104
Beijing                  2005
Sydney                   1943
Atlanta                  1795
Los Angeles              1720
Barcelona                1418
Paris                    1325
Antwerp                  1288
Stockholm                 861
Berlin                    855
Seoul                     841
Helsinki                  719
Amsterdam                 682
Montreal                  664
Mexico                    662
Munich                    643
Tokyo                     635
Melbourne / Stockholm     610
Rome                      566
Moscow                    504
St Louis                  462
Name: Country, dtype: int64

In [22]:
#We cannot tell which city held the most Olympic but most events were held in London in this dataset.